{
    "rsm": {
      "contact": {
        "nameContact": {
          "name": "Greg Thorson",
          "email": "gthorson73@gmail.com",
          "phone": "917.494.2771"
        },
        "address": {
          "street": "100 West 72nd Steet #5D",
          "city": "New York, NY",
          "zip": "10023"
        }
      },
      "skills": {
        "title": "Top Skills",
        "items": [
          {
            "item": {
              "active": true,
              "text": "<u>Core</u>: JavaScript (ES6), Node.js, Jest, PHP, JSON, XML, Python"
            }
          },
          {
            "item": {
              "active": true,
              "text": "<u>Front End</u>: React, HTML5, CSS3, MaterialUI, Bootstrap"
            }
          },
          {
            "item": {
              "active": true,
              "text": "<u>Database</u>: MySQL, Google Big Query, Google Ad Manager, MS Access"
            }
          },
          {
            "item": {
              "active": true,
              "text": "<u>Tooling</u>: Docker, Webpack, Git"
            }
          },
          {
            "item": {
              "active": true,
              "text": "<u>Ad Tech</u>: IAB specifications, Prebid.js, Amazon TAM, Google Publisher Tags, Google Ad Manager, VPAID, Privacy regulations e.g. GDPR and CCPA"
            }
          },
          {
            "item": {
              "active": true,
              "text": "<u>Back End Frameworks</u>: WordPress, Laravel"
            }
          },
          {
            "item": {
              "active": true,
              "text": "<u>API</u>: REST, GraphQL"
            }
          },
          {
            "item": {
              "active": true,
              "text": "<u>Developing</u>: NumPy, Pandas, MongoDB"
            }
          }
        ]
      },
      "accomplishments": {
        "title": "Top Accomplishments",
        "items": [
          {
            "item": {
              "active": true,
              "text": "Modularizing, streamlining, and DRY codebases (all recent employers)"
            }
          },
          {
            "item": {
              "active": true,
              "text": "Developing custom codebases that can make use of, and contribute to, re-usable libraries"
            }
          },
          {
            "item": {
              "active": true,
              "text": "Using data analytics to drive actionable insights around user behaviors and to troubleshoot real-world issues"
            }
          },
          {
            "item": {
              "active": true,
              "text": "Introducting and evangelizing unit tests"
            }
          },
          {
            "item": {
              "active": true,
              "text": "Staying ahead of the trends in ad tech, such as the rise of privacy regulations e.g. GDPR and CCPA and the sunsetting of third party cookies."
            }
          }
        ]
      },
      "experience": {
        "title": "Professional Exprience",
        "positions": [
          {
            "id": "currentProjects3",
            "title": "Python/Docker Developer - Self Employed",
            "duration": {
              "start": "2024",
              "end": "Present"
            },
            "headline": "Developing Docker containers for learning, sandboxing, development, and API integration.",
            "skillz": "Python, Docker, GraphQL, API, AI Prompts"
          },
          {
            "id": "apartmentTherapy",
            "title": "Software Engineer, Ad Tech",
            "company": {
              "coName": "Apartment Therapy Media"
            },
            "duration": {
              "start": "2021",
              "end": "2023"
            },
            "headline": "Optimized ad tech functionality and header bidding for lifestyle websites.",
            "skillz": "ES6, React, Next.js, header bidding, video header bidding, Jest",
            "details": {
              "item": [
                "Engineered Prebid and Amazon TAM integrations from the ground up.",
                "Introduced video header bidding.",
                "Increased unit test coverage, enhancing development speed and safety.",
                "Developed ad rendering strategies that enhanced viewability and boosted bid values.",
                "Created comprehensive ad injection logic documentation, aligning stakeholders.",
                "Directed user response analysis for new ad types, leveraging Google Ad Manager and Google Analytics."
              ]
            }
          },
          {
            "id": "zappyride",
            "title": "Senior Front End Engineer",
            "company": {
              "coName": "ZappyRide"
            },
            "duration": {
              "start": "2020",
              "end": "2021"
            },
            "headline": "Executed end-to-end development of web tools to highlight electric vehicle benefits.",
            "skillz": "React, GraphQL API, CSS3, HTML5, statistics, data representation",
            "details": {
              "item": [
                "Pioneered inversion-of-control architecture in React, enabling flexible app development.",
                "Created algorithms to evaluate economic and ecological impacts of \"going electric\" across regions.",
                "Built a platform guiding industrial fleets in transitioning to electric or hydrogen vehicles."
              ]
            }
          },
          {
            "id": "billboard",
            "company": {
              "coName": "Billboard, The Hollywood Reporter, and Vibe"
            },
            "title": "Senior Front End Engineer: Ad Tech",
            "duration": {
              "start": "2019",
              "end": "2020"
            },
            "headline": "Maximized ad revenue by spearheading front-end ad wrapper development.",
            "skillz": "ES6, TypeScript, NPM, Python, CSS3, Docker, header bidding, video header bidding, viewability verification",
            "details": {
              "item": [
                "Replaced legacy ad wrapper, improving compatibility with new site developments.",
                "Reduced development cycles from weeks to days by decoupling ad tech and site codebases.",
                "Created an NPM module to support Video Header Bidding.",
                "Guided and mentored new hires and junior developers."
              ]
            }
          },
          {
            "id": "sheknows",
            "company": {
              "coName": "SHEMedia"
            },
            "title": "Full Stack Engineer",
            "duration": {
              "start": "2017",
              "end": "2019"
            },
            "headline": "Developed full-stack online ad products, empowering 1000+ publishers to monetize content.",
            "skillz": "ES6, PHP, Laravel, Blade, Docker, privacy regulations, liaising with vendors",
            "details": {
              "item": [
                "Refactored a 9000-line JavaScript codebase into modules, enhancing development speed and safety.",
                "Developed a WordPress plugin to streamline ad tech integration for SHEMedia partners.",
                "Implemented Jest unit testing for robust code validation.",
                "Deployed a network-wide GDPR solution in collaboration with QuantCast.",
                "Created a WordPress plugin that simplified ad tech integration for SHEMedia's publisher partner sites"
              ]
            }
          },
          {
            "id": "viant",
            "company": {
              "coName": "Vindico/VIANT Time Inc"
            },
            "title": "Lead Software Engineer",
            "duration": {
              "start": "2011",
              "end": "2017"
            },
            "headline": "ept video ad rendering and playback app competitive and ahead of industry and technical trends.",
            "skillz": "ES6, SQL, GBQ, RTB, VPAID, ActionScript 3.0, ES5, VPAID, Docker, unit testing, viewability verification",
            "details": {
              "item": [
                "Led development of a JavaScript video ad platform for playback and event tracking.",
                "Engineered tools for creating custom video ad formats tailored to clients across diverse industries.",
                "Engineered video viewability verification solutions in partnership with MOAT, Integral Ad Science, and ComScore.",
                "Diagnosed and resolved production issues within hours, using database intelligence.",
                "Developed a query library for diagnosing and troubleshooting production issues with tracking data.",
                "Led development efforts for integrations with third-party video players."
              ]
            }
          },
          {
            "id": "abc",
            "company": {
              "coName": "Walt Disney/ABC"
            },
            "title": "Web Developer/Technical Project Manager",
            "duration": {
              "start": "2007",
              "end": "2011"
            },
            "headline": "Created web-based tools for Sales and Marketing, optimizing content production.",
            "skillz": "ActionScript 3.0, ES5, HTML5, CSS, PHP, SQL, Visual Basic",
            "details": {
              "item": [
                "Directed a multi-disciplinary team for nationwide live online video broadcasts.",
                "Developed automated solution for entering large Nielsen data sets, saving the team weeks of manual effort.",
                "Led two website restructures, integrating modern technologies.",
                "Enhanced content production and updates through reusable methods and cross-platform XML schemas.",
                "Developed the inaugural mobile version of the website."
              ]
            }
          }
        ]
      },
      "education": {
        "title": "Education",
        "school": [
          {
            "id": "columbia",
            "school": {
              "schName": "Columbia University",
              "schAddress": "New York, NY"
            }
          },
          {
            "id": "pitt",
            "school": {
              "schName": "University of Pittsburgh",
              "schAddress": "Pittsburgh, PA"
            }
          },
          {
            "id": "usc",
            "school": {
              "schName": "University of Southern California",
              "schAddress": "Los Angeles, CA"
            }
          }
        ]
      }
    }
  }
  